In [1]:
%load_ext sql

In [4]:
%sql postgresql://postgres:postgres@db/postgres

'Connected: postgres@postgres'

In [5]:
%%sql
CREATE TABLE people (first text, last text, drink text);
INSERT INTO people (first,last,drink)
VALUES
    ('zaphod','beeblebrox','pan galactic gargle blaster'),
    ('arthur','dent','tea'),
    ('ford','prefect','old janx spirit')
    ;

 * postgres@postgres
 * postgresql://postgres:postgres@db/postgres
Done.
3 rows affected.

[]

In [6]:
%sql select * from people

 * postgres@postgres
 * postgresql://postgres:postgres@db/postgres
3 rows affected.

[('zaphod', 'beeblebrox', 'pan galactic gargle blaster'),
 ('arthur', 'dent', 'tea'),
 ('ford', 'prefect', 'old janx spirit')]